AddictiveInstruments/ADIOS/adios/STM32G0xx/adios_uart.c
//! \defgroup ADIOS_UART
//!
//! U(S)ART functions for ADIOS - STM32G0xx
//!
//! Applications shouldn't call these functions directly, instead please use \ref ADIOS_COM or \ref ADIOS_MIDI layer functions
//!
//! Up to 8 ports are supported: the 6 USART peripherals present on the
//! 6-USART G0 chip WITHOUT LPUART (STM32G0B0), plus UART6/UART7 which alias
//! LPUART1/LPUART2 on the "+LPUART" sibling tiers (see below). Coverage by
//! chip tier (verified against the CMSIS device-tier macros - STM32G070xx
//! etc, one of which stm32g0xx.h's own dispatcher requires be defined - not
//! the exact ADIOS_PROCESSOR_STM32G070CB part number, so every flash/pin
//! variant of the same silicon is covered automatically).
//!
//! Port numbering follows ST's own peripheral numbering: ADIOS_UARTn is
//! USART(n+1) - UART0=USART1, UART1=USART2, ... UART5=USART6 - then
//! UART6/UART7 for LPUART1/LPUART2. Check the tier table below: the smaller
//! chips do not carry every USART, and asking for one they lack is refused
//! at compile time. Declare the ports you want with ADIOS_USE_UARTx
//! and any pin/peripheral overrides.
//!
//! Coverage by chip tier:
//!   - 2-USART (G030/G050): UART0/UART1 only (USART1/USART2).
//!   - 2-USART+LPUART1 (G031/G041/G051/G061): UART0/UART1, plus UART6
//!     (LPUART1) on its own independent vector (LPUART1_IRQn) - not shared
//!     with anything.
//!   - 4-USART (G070): UART0..UART3 (USART1..USART4); USART3+4 share one
//!     NVIC vector (USART3_4_IRQn).
//!   - 4-USART+LPUART1 (G071/G081): UART0..UART3 like G070, plus UART6
//!     (LPUART1) - but here USART3+4+LPUART1 share ONE vector together
//!     (USART3_4_LPUART1_IRQn, a different name than the plain 4-USART
//!     tier's USART3_4_IRQn even though the port count is the same).
//!   - 6-USART (G0B0): UART0..UART5 (USART1..USART6); USART3+4+5+6 share one
//!     NVIC vector (USART3_4_5_6_IRQn) - a 4-way share, not the same vector
//!     name as the 4-USART tier above, hence the tier-conditional
//!     ADIOS_UART_SHARED_IRQ_CHANNEL/IRQHANDLER_FUNC macros below.
//!   - 6-USART+2xLPUART (G0B1/G0C1): UART0..UART5 like G0B0, plus UART6
//!     (LPUART1, sharing USART3_4_5_6_LPUART1_IRQn with UART2/3/4/5) and
//!     UART7 (LPUART2) - which, unusually, shares UART1's own vector
//!     instead (USART2_LPUART2_IRQn) - USART2 is NOT independent on this
//!     one tier, unlike every other G0 tier. See ADIOS_UART1_IRQ_CHANNEL/
//!     IRQHANDLER_FUNC below, which are tier-conditional for this reason.
//!
//! LPUART registers alias the same USART_TypeDef layout (ISR/RDR/TDR/CR1 -
//! confirmed in CMSIS: LPUARTx is literally "(USART_TypeDef *)LPUARTx_BASE"),
//! so the generic RXNE/TXE interrupt handling and raw buffer routines below
//! work unchanged for UART6/UART7. Only initialisation differs: LPUART uses
//! its own LL_LPUART_Init/fixed x256 oversampling/PRESC-based BRR formula
//! (see ADIOS_UART_BaudrateSet), not LL_USART_Init. Both LPUART1 and
//! LPUART2 default to PCLK1 as their RCC clock source (ADIOS_UART6/7_
//! CLOCK_SOURCE, overridable) - the same source the other ports already use
//! by default - not LSE: LSE's 32.768kHz is far too slow for a MIDI baud
//! rate (fclk/baudrate ratio would be ~1, LPUART requires >=~3), and the
//! Stop-mode wakeup LSE would otherwise enable isn't used by this driver.
//!
//! Default pin/peripheral assignment (STM32G070CB) - override individually in a
//! local adios_config.h if your project uses different pins or a different UART
//! peripheral (e.g. STM32G050K8):
//! \code
//!   #define ADIOS_UART0_TX_PORT     GPIOB
//!   #define ADIOS_UART0_TX_PIN      LL_GPIO_PIN_6
//!   #define ADIOS_UART0_TX_AF       LL_GPIO_AF_0
//!   #define ADIOS_UART0_RX_PORT     GPIOB
//!   #define ADIOS_UART0_RX_PIN      LL_GPIO_PIN_7
//!   #define ADIOS_UART0_RX_AF       LL_GPIO_AF_0
//!   #define ADIOS_UART0             USART1
//!   #define ADIOS_UART0_IRQ_CHANNEL USART1_IRQn
//!   #define ADIOS_UART0_IRQHANDLER_FUNC void USART1_IRQHandler(void)
//!   #define ADIOS_UART0_RESET_FUNC  { ... }
//!   #define ADIOS_UART0_CLOCK_FUNC  { ... }
//! \endcode
//! (same set of defines exists for ADIOS_UART1..UART7)
//!
//! If your board runs the TX pin through an external level-shifting stage
//! that inverts the signal (e.g. a 3V3->5V transistor for a MIDI DIN output),
//! define ADIOS_UARTx_TX_INVERTED for that port - every port defaults to
//! normal (non-inverted) polarity, this is a per-project hardware fact, not
//! a peripheral default, so it's opt-in only:
//! \code
//!   #define ADIOS_UART2_TX_INVERTED
//! \endcode
//!
//! \{
/* ==========================================================================
 *
 *  Copyright (C) 2026 Bruno Dupeyron (addictive.instruments@gmail.com)
 *  Licensed under MIT License.
 *  See the LICENSE file in the project root for full licence information.
 *
 * ==========================================================================
 */

/////////////////////////////////////////////////////////////////////////////
// Include files
/////////////////////////////////////////////////////////////////////////////

#include <adios.h>

// USART1 (UART0) and USART2 (UART1) exist on EVERY G0 chip - never gated.

// USART3 (UART2) and USART4 (UART3) exist on the 4-USART tier (G070/G071/
// G081) and the 6-USART tier (G0B0/G0B1/G0C1) - checked via the CMSIS
// device-tier macro (defined by stm32g0xx.h's own dispatcher once
// ADIOS_PROCESSOR_xxx has selected a device header) rather than the exact
// ADIOS_PROCESSOR_STM32G070CB part number, so every flash/pin variant of
// the same silicon is covered automatically. The "+LPUART" siblings
// (G071/G081, G0B1/G0C1) are included here too - their shared vector name
// differs (see ADIOS_UART_SHARED_IRQ_CHANNEL below, which is tier-
// conditional for exactly this reason) but is now fully resolved.
#if defined(ADIOS_USE_UART2) && !(defined(STM32G070xx) || defined(STM32G0B0xx) || defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef ADIOS_USE_UART2
#endif
#if defined(ADIOS_USE_UART3) && !(defined(STM32G070xx) || defined(STM32G0B0xx) || defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef ADIOS_USE_UART3
#endif

// USART5 (UART4) and USART6 (UART5) exist on the 6-USART tier, with or
// without LPUART (G0B0/G0B1/G0C1).
#if defined(ADIOS_USE_UART4) && !(defined(STM32G0B0xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef ADIOS_USE_UART4
#endif
#if defined(ADIOS_USE_UART5) && !(defined(STM32G0B0xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef ADIOS_USE_UART5
#endif

