AddictiveInstruments/ADIOS/adios/STM32G0xx/adios_uart.c
// UART6 (LPUART1) exists on every "+LPUART" G0 tier (2/4/6-USART siblings).
#if defined(ADIOS_USE_UART6) && !(defined(STM32G031xx) || defined(STM32G041xx) || defined(STM32G051xx) || defined(STM32G061xx) || defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef ADIOS_USE_UART6
#endif

// UART7 (LPUART2) exists ONLY on the 6-USART+2xLPUART tier (G0B1/G0C1) -
// the 2-USART and 4-USART "+LPUART" siblings only ever get one LPUART.
#if defined(ADIOS_USE_UART7) && !(defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef ADIOS_USE_UART7
#endif

// auto-derive the master switch from any individual port actually wanted -
// no need for the project to separately set ADIOS_USE_UART on top of
// ADIOS_USE_UARTx. Safe to do locally in this .c file only because nothing
// outside adios_uart.c ever checks the bare ADIOS_USE_UART macro
// (verified) - unlike ADIOS_USE_SPI, which core/
// main.c also checks directly, so that one is derived from the shared
// header (adios_spi.h) instead, not locally in adios_spi.c.
// Derived AFTER the tier guards above, deliberately: a port the project
// asked for may have just been dropped because this chip doesn't have it,
// and the master switch must reflect what actually survived - otherwise the
// whole module would compile its buffers and Init() for zero usable ports.
#if !defined(ADIOS_USE_UART) && (defined(ADIOS_USE_UART0) || defined(ADIOS_USE_UART1) || defined(ADIOS_USE_UART2) || defined(ADIOS_USE_UART3) || defined(ADIOS_USE_UART4) || defined(ADIOS_USE_UART5) || defined(ADIOS_USE_UART6) || defined(ADIOS_USE_UART7))
#define ADIOS_USE_UART
#endif

// ...and if nothing survived while a UART-based transport was requested,
// say so loudly. Silence is the wrong answer here: the build would succeed,
// ADIOS_UART_Init() would drive nothing, and the symptom on the bench is a
// board that simply never answers - diagnosed the hard way on a G030K6,
// whose config asked for UART0 back when that meant USART3, a peripheral
// that chip doesn't have.
#if defined(ADIOS_USE_DIN_MIDI) && !defined(ADIOS_USE_UART)
# error "ADIOS_USE_DIN_MIDI is enabled, but no ADIOS_USE_UARTx port survives on this chip - see the tier table at the top of this file and pick a port this device actually has (ADIOS_UARTn is USART(n+1))."
#endif

// this module can be optionally enabled in a local adios_config.h file (included from adios.h)
#if defined(ADIOS_USE_UART)


// Tier flag: does this chip's LPUART1 (UART6) share a vector with the
// USART3+ group below (ADIOS_UART_SHARED_IRQ_CHANNEL) instead of having
// its own independent LPUART1_IRQn? True on the 4-USART+LPUART1 and
// 6-USART+2xLPUART tiers; false (independent vector) on the 2-USART+
// LPUART1 tier, where there's no USART3+ group to share with in the first
// place.
#if defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx)
#define ADIOS_G0_LPUART1_SHARED 1
#endif

// Tier flag: does this chip have a second LPUART (UART7), which always
// shares USART2's (UART1's) own vector rather than USART2 being
// independent? True only on the 6-USART+2xLPUART tier.
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
#define ADIOS_G0_LPUART2_TIER 1
#endif

// USART3/USART4 (and, on the 6-USART tier, USART5/USART6 too, and on the
// "+LPUART" siblings, LPUART1/UART6 too) share a single NVIC vector - but
// the vector's NAME differs by tier (verified via CMSIS): USART3+4 on the
// plain 4-USART tier, USART3+4+5+6 together on the plain 6-USART tier,
// USART3+4+LPUART1 on the 4-USART+LPUART1 tier, USART3+4+5+6+LPUART1 on the
// 6-USART+2xLPUART tier. Every UARTx macro block below that touches this
// shared vector resolves through these two macros instead of a hardcoded
// name, so the SAME handler function below is correct on every tier
// without a chip-specific #ifdef inside the handler itself.
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
#define ADIOS_UART_SHARED_IRQ_CHANNEL    USART3_4_5_6_LPUART1_IRQn
#define ADIOS_UART_SHARED_IRQHANDLER_FUNC void USART3_4_5_6_LPUART1_IRQHandler(void)
#elif defined(STM32G0B0xx)
#define ADIOS_UART_SHARED_IRQ_CHANNEL    USART3_4_5_6_IRQn
#define ADIOS_UART_SHARED_IRQHANDLER_FUNC void USART3_4_5_6_IRQHandler(void)
#elif defined(STM32G071xx) || defined(STM32G081xx)
#define ADIOS_UART_SHARED_IRQ_CHANNEL    USART3_4_LPUART1_IRQn
#define ADIOS_UART_SHARED_IRQHANDLER_FUNC void USART3_4_LPUART1_IRQHandler(void)
#else
#define ADIOS_UART_SHARED_IRQ_CHANNEL    USART3_4_IRQn
#define ADIOS_UART_SHARED_IRQHANDLER_FUNC void USART3_4_IRQHandler(void)
#endif


/////////////////////////////////////////////////////////////////////////////
// Pin definitions and USART mappings
/////////////////////////////////////////////////////////////////////////////

// fixed number of port "slots" (buffers, arrays) - independent of how many
// are actually enabled via ADIOS_USE_UARTx, same pattern as adios_spi.c
#define ADIOS_UART_MAX_PORTS 8

// UART0 (USART1 peripheral) - exists on EVERY G0 tier, never force-undef'd,
// so this #if is purely for structural symmetry with every other port block
// (not strictly required, but keeps "block == #if defined(ADIOS_USE_UARTx)"
// a reliable invariant everywhere in this file).
#if defined(ADIOS_USE_UART0)
#ifndef ADIOS_UART0_TX_PORT
#define ADIOS_UART0_TX_PORT     GPIOB
#endif
#ifndef ADIOS_UART0_TX_PIN
#define ADIOS_UART0_TX_PIN      LL_GPIO_PIN_6
#endif
#ifndef ADIOS_UART0_TX_AF
#define ADIOS_UART0_TX_AF       LL_GPIO_AF_0
#endif
#ifndef ADIOS_UART0_RX_PORT
#define ADIOS_UART0_RX_PORT     GPIOB
#endif
#ifndef ADIOS_UART0_RX_PIN
#define ADIOS_UART0_RX_PIN      LL_GPIO_PIN_7
#endif
#ifndef ADIOS_UART0_RX_AF
#define ADIOS_UART0_RX_AF       LL_GPIO_AF_0
#endif
#ifndef ADIOS_UART0
#define ADIOS_UART0             USART1
#endif
#ifndef ADIOS_UART0_IRQ_CHANNEL
#define ADIOS_UART0_IRQ_CHANNEL USART1_IRQn
#endif
#ifndef ADIOS_UART0_IRQHANDLER_FUNC
#define ADIOS_UART0_IRQHANDLER_FUNC void USART1_IRQHandler(void)
#endif
#ifndef ADIOS_UART0_RESET_FUNC
#define ADIOS_UART0_RESET_FUNC  { LL_APB2_GRP1_ForceReset(LL_APB2_GRP1_PERIPH_USART1); LL_APB2_GRP1_ReleaseReset(LL_APB2_GRP1_PERIPH_USART1); }
#endif
#ifndef ADIOS_UART0_CLOCK_FUNC
#define ADIOS_UART0_CLOCK_FUNC  { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOB); }
#endif
#ifndef ADIOS_UART0_CLOCK_SOURCE
#define ADIOS_UART0_CLOCK_SOURCE LL_RCC_USART1_CLKSOURCE_PCLK1
#endif
#endif

