AddictiveInstruments/ADIOS/adios/STM32G0xx/adios_uart.c
// UART1 (USART2 peripheral) - exists on EVERY G0 tier (2/4/6-USART, with or
// without LPUART), no force-undef needed. PA2/PA3 chosen over the
// alternative PA14/PA15 pins: those are SWCLK/SWDIO (debug port) on every
// STM32, a real conflict avoided here rather than a hypothetical one.
// IRQ_CHANNEL/IRQHANDLER_FUNC are tier-conditional: on every tier except
// 6-USART+2xLPUART (G0B1/G0C1), USART2 has its own independent vector
// (USART2_IRQn) like everywhere else in this file. On G0B1/G0C1 ONLY,
// USART2 shares its vector with LPUART2/UART7 instead (USART2_LPUART2_IRQn)
// - there is no USART2_IRQn on that one tier. See the combined handler
// further below, which services UART1 and/or UART7 depending on which are
// actually enabled.
#if defined(ADIOS_USE_UART1)
#ifndef ADIOS_UART1_TX_PORT
#define ADIOS_UART1_TX_PORT     GPIOA
#endif
#ifndef ADIOS_UART1_TX_PIN
#define ADIOS_UART1_TX_PIN      LL_GPIO_PIN_2
#endif
#ifndef ADIOS_UART1_TX_AF
#define ADIOS_UART1_TX_AF       LL_GPIO_AF_1
#endif
#ifndef ADIOS_UART1_RX_PORT
#define ADIOS_UART1_RX_PORT     GPIOA
#endif
#ifndef ADIOS_UART1_RX_PIN
#define ADIOS_UART1_RX_PIN      LL_GPIO_PIN_3
#endif
#ifndef ADIOS_UART1_RX_AF
#define ADIOS_UART1_RX_AF       LL_GPIO_AF_1
#endif
#ifndef ADIOS_UART1
#define ADIOS_UART1             USART2
#endif
#ifndef ADIOS_UART1_IRQ_CHANNEL
# if defined(ADIOS_G0_LPUART2_TIER)
#  define ADIOS_UART1_IRQ_CHANNEL USART2_LPUART2_IRQn
# else
#  define ADIOS_UART1_IRQ_CHANNEL USART2_IRQn
# endif
#endif
#ifndef ADIOS_UART1_IRQHANDLER_FUNC
# if defined(ADIOS_G0_LPUART2_TIER)
#  define ADIOS_UART1_IRQHANDLER_FUNC void USART2_LPUART2_IRQHandler(void)
# else
#  define ADIOS_UART1_IRQHANDLER_FUNC void USART2_IRQHandler(void)
# endif
#endif
#ifndef ADIOS_UART1_RESET_FUNC
#define ADIOS_UART1_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART2); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART2); }
#endif
#ifndef ADIOS_UART1_CLOCK_FUNC
#define ADIOS_UART1_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOA); }
#endif
#endif

// UART2 (USART3 peripheral) - see ADIOS_USE_UART2 force-undef above (not
// available on the 2-USART tiers). Wrapped in #if defined(ADIOS_USE_UART2)
// like every other port block here - unlike UART0/UART1 above, USART3 does
// NOT exist on every G0 chip, so leaving this unguarded would define
// ADIOS_UART2 (-> bare "USART3") even on chips where that identifier isn't
// declared by CMSIS at all - harmless today only because every actual USE of
// ADIOS_UART2 elsewhere already re-checks ADIOS_USE_UART2 itself, but a
// latent trap for any future code that doesn't.
#if defined(ADIOS_USE_UART2)
#ifndef ADIOS_UART2_TX_PORT
#define ADIOS_UART2_TX_PORT     GPIOB
#endif
#ifndef ADIOS_UART2_TX_PIN
#define ADIOS_UART2_TX_PIN      LL_GPIO_PIN_8
#endif
#ifndef ADIOS_UART2_TX_AF
#define ADIOS_UART2_TX_AF       LL_GPIO_AF_4
#endif
#ifndef ADIOS_UART2_RX_PORT
#define ADIOS_UART2_RX_PORT     GPIOB
#endif
#ifndef ADIOS_UART2_RX_PIN
#define ADIOS_UART2_RX_PIN      LL_GPIO_PIN_9
#endif
#ifndef ADIOS_UART2_RX_AF
#define ADIOS_UART2_RX_AF       LL_GPIO_AF_4
#endif
#ifndef ADIOS_UART2
#define ADIOS_UART2             USART3
#endif
#ifndef ADIOS_UART2_IRQ_CHANNEL
#define ADIOS_UART2_IRQ_CHANNEL ADIOS_UART_SHARED_IRQ_CHANNEL
#endif
#ifndef ADIOS_UART2_IRQHANDLER_FUNC
#define ADIOS_UART2_IRQHANDLER_FUNC ADIOS_UART_SHARED_IRQHANDLER_FUNC
#endif
#ifndef ADIOS_UART2_RESET_FUNC
#define ADIOS_UART2_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART3); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART3); }
#endif
#ifndef ADIOS_UART2_CLOCK_FUNC
#define ADIOS_UART2_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART3); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOB); }
#endif
// #define ADIOS_UART2_CLOCK_SOURCE <LL_RCC_USARTx_CLKSOURCE_...>  // not defined by default
#endif

// UART3 (USART4 peripheral) - exists on the 4-USART tier (G070) and the
// 6-USART tier (G0B0), see ADIOS_USE_UART3 force-undef above. Shares the
// tier-appropriate ADIOS_UART_SHARED_IRQ_CHANNEL vector with UART2 (and,
// on the 6-USART tier, also with UART4/UART5) - the IRQ handler is written
// once below and services whichever of these ports is actually enabled.
#if defined(ADIOS_USE_UART3)
#ifndef ADIOS_UART3_TX_PORT
#define ADIOS_UART3_TX_PORT     GPIOA
#endif
#ifndef ADIOS_UART3_TX_PIN
#define ADIOS_UART3_TX_PIN      LL_GPIO_PIN_0
#endif
#ifndef ADIOS_UART3_TX_AF
#define ADIOS_UART3_TX_AF       LL_GPIO_AF_4
#endif
#ifndef ADIOS_UART3_RX_PORT
#define ADIOS_UART3_RX_PORT     GPIOA
#endif
#ifndef ADIOS_UART3_RX_PIN
#define ADIOS_UART3_RX_PIN      LL_GPIO_PIN_1
#endif
#ifndef ADIOS_UART3_RX_AF
#define ADIOS_UART3_RX_AF       LL_GPIO_AF_4
#endif
#ifndef ADIOS_UART3
#define ADIOS_UART3             USART4
#endif
#ifndef ADIOS_UART3_IRQ_CHANNEL
#define ADIOS_UART3_IRQ_CHANNEL ADIOS_UART_SHARED_IRQ_CHANNEL
#endif
#ifndef ADIOS_UART3_RESET_FUNC
#define ADIOS_UART3_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART4); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART4); }
#endif
#ifndef ADIOS_UART3_CLOCK_FUNC
#define ADIOS_UART3_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART4); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOA); }
#endif
#endif

// UART4 (USART5 peripheral) - only exists on the 6-USART tier (G0B0), see
// ADIOS_USE_UART4 force-undef above. Shares ADIOS_UART_SHARED_IRQ_CHANNEL
// with UART2/UART3/UART5 on this tier.
// PIN MAPPING NOT VERIFIED against a real reference manual or reference
// hardware (no G0B0 board in hand this session) - override
// ADIOS_UART4_{TX,RX}_{PORT,PIN,AF} in your project's adios_config.h once
// you have real hardware. Chosen only to avoid an obvious collision with
// UART2..UART3's own default pins above.
#if defined(ADIOS_USE_UART4)
#ifndef ADIOS_UART4_TX_PORT
#define ADIOS_UART4_TX_PORT     GPIOC
#endif
#ifndef ADIOS_UART4_TX_PIN
#define ADIOS_UART4_TX_PIN      LL_GPIO_PIN_0
#endif
#ifndef ADIOS_UART4_TX_AF
#define ADIOS_UART4_TX_AF       LL_GPIO_AF_1
#endif
#ifndef ADIOS_UART4_RX_PORT
#define ADIOS_UART4_RX_PORT     GPIOC
#endif
#ifndef ADIOS_UART4_RX_PIN
#define ADIOS_UART4_RX_PIN      LL_GPIO_PIN_1
#endif
#ifndef ADIOS_UART4_RX_AF
#define ADIOS_UART4_RX_AF       LL_GPIO_AF_1
#endif
#ifndef ADIOS_UART4
#define ADIOS_UART4             USART5
#endif
#ifndef ADIOS_UART4_IRQ_CHANNEL
#define ADIOS_UART4_IRQ_CHANNEL ADIOS_UART_SHARED_IRQ_CHANNEL
#endif
#ifndef ADIOS_UART4_RESET_FUNC
#define ADIOS_UART4_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART5); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART5); }
#endif
#ifndef ADIOS_UART4_CLOCK_FUNC
#define ADIOS_UART4_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART5); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOC); }
#endif
#endif

// UART5 (USART6 peripheral) - only exists on the 6-USART tier (G0B0/G0B1/
// G0C1), see ADIOS_USE_UART5 force-undef above. Shares
// ADIOS_UART_SHARED_IRQ_CHANNEL with UART2/UART3/UART4 (and, on the
// "+LPUART" sibling of this tier, UART6/LPUART1 too) on this tier.
// PIN MAPPING NOT VERIFIED - see UART4 above, same caveat applies.
#if defined(ADIOS_USE_UART5)
#ifndef ADIOS_UART5_TX_PORT
#define ADIOS_UART5_TX_PORT     GPIOC
#endif
#ifndef ADIOS_UART5_TX_PIN
#define ADIOS_UART5_TX_PIN      LL_GPIO_PIN_2
#endif
#ifndef ADIOS_UART5_TX_AF
#define ADIOS_UART5_TX_AF       LL_GPIO_AF_2
#endif
#ifndef ADIOS_UART5_RX_PORT
#define ADIOS_UART5_RX_PORT     GPIOC
#endif
#ifndef ADIOS_UART5_RX_PIN
#define ADIOS_UART5_RX_PIN      LL_GPIO_PIN_3
#endif
#ifndef ADIOS_UART5_RX_AF
#define ADIOS_UART5_RX_AF       LL_GPIO_AF_2
#endif
#ifndef ADIOS_UART5
#define ADIOS_UART5             USART6
#endif
#ifndef ADIOS_UART5_IRQ_CHANNEL
#define ADIOS_UART5_IRQ_CHANNEL ADIOS_UART_SHARED_IRQ_CHANNEL
#endif
#ifndef ADIOS_UART5_RESET_FUNC
#define ADIOS_UART5_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART6); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART6); }
#endif
#ifndef ADIOS_UART5_CLOCK_FUNC
#define ADIOS_UART5_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART6); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOC); }
#endif
#endif

