AddictiveInstruments/ADIOS/adios/STM32G0xx/adios_uart.c
// UART6 (LPUART1 peripheral) - exists on every "+LPUART" G0 tier, see
// ADIOS_USE_UART6 force-undef above. Vector depends on tier
// (ADIOS_G0_LPUART1_SHARED, set above): independent LPUART1_IRQn on the
// 2-USART+LPUART1 tier, or the shared ADIOS_UART_SHARED_IRQ_CHANNEL
// group (with UART2/UART3[/UART4/UART5]) on the 4-USART+LPUART1 and
// 6-USART+2xLPUART tiers.
// PIN MAPPING NOT VERIFIED against a real reference manual or reference
// hardware (no board with any of these chips in hand this session) -
// override ADIOS_UART6_{TX,RX}_{PORT,PIN,AF} in your project's
// adios_config.h once you have real hardware. Chosen only to avoid an
// obvious collision with UART2..UART5's own default pins above.
// Clock source defaults to PCLK1 like every other port (see module-level
// comment) - LPUART's fixed x256 oversampling and PRESC-based BRR are
// handled in ADIOS_UART_BaudrateSet, not here.
#if defined(ADIOS_USE_UART6)
#ifndef ADIOS_UART6_TX_PORT
#define ADIOS_UART6_TX_PORT     GPIOA
#endif
#ifndef ADIOS_UART6_TX_PIN
#define ADIOS_UART6_TX_PIN      LL_GPIO_PIN_6
#endif
#ifndef ADIOS_UART6_TX_AF
#define ADIOS_UART6_TX_AF       LL_GPIO_AF_1
#endif
#ifndef ADIOS_UART6_RX_PORT
#define ADIOS_UART6_RX_PORT     GPIOA
#endif
#ifndef ADIOS_UART6_RX_PIN
#define ADIOS_UART6_RX_PIN      LL_GPIO_PIN_7
#endif
#ifndef ADIOS_UART6_RX_AF
#define ADIOS_UART6_RX_AF       LL_GPIO_AF_1
#endif
#ifndef ADIOS_UART6
#define ADIOS_UART6             LPUART1
#endif
#ifndef ADIOS_UART6_IRQ_CHANNEL
# if defined(ADIOS_G0_LPUART1_SHARED)
#  define ADIOS_UART6_IRQ_CHANNEL ADIOS_UART_SHARED_IRQ_CHANNEL
# else
#  define ADIOS_UART6_IRQ_CHANNEL LPUART1_IRQn
# endif
#endif
#ifndef ADIOS_UART6_IRQHANDLER_FUNC
# if defined(ADIOS_G0_LPUART1_SHARED)
#  define ADIOS_UART6_IRQHANDLER_FUNC ADIOS_UART_SHARED_IRQHANDLER_FUNC
# else
#  define ADIOS_UART6_IRQHANDLER_FUNC void LPUART1_IRQHandler(void)
# endif
#endif
#ifndef ADIOS_UART6_RESET_FUNC
#define ADIOS_UART6_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_LPUART1); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_LPUART1); }
#endif
#ifndef ADIOS_UART6_CLOCK_FUNC
#define ADIOS_UART6_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_LPUART1); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOA); }
#endif
#ifndef ADIOS_UART6_CLOCK_SOURCE
#define ADIOS_UART6_CLOCK_SOURCE LL_RCC_LPUART1_CLKSOURCE_PCLK1
#endif
#endif

// UART7 (LPUART2 peripheral) - exists ONLY on the 6-USART+2xLPUART tier
// (G0B1/G0C1), see ADIOS_USE_UART7 force-undef above. Always shares
// UART1's vector on this tier (ADIOS_UART1_IRQ_CHANNEL/IRQHANDLER_FUNC,
// already tier-conditional - see UART1 above) - there's no separate
// independent vector for LPUART2 on any G0 chip.
// PIN MAPPING NOT VERIFIED - see UART6 above, same caveat applies.
#if defined(ADIOS_USE_UART7)
#ifndef ADIOS_UART7_TX_PORT
#define ADIOS_UART7_TX_PORT     GPIOB
#endif
#ifndef ADIOS_UART7_TX_PIN
#define ADIOS_UART7_TX_PIN      LL_GPIO_PIN_10
#endif
#ifndef ADIOS_UART7_TX_AF
#define ADIOS_UART7_TX_AF       LL_GPIO_AF_4
#endif
#ifndef ADIOS_UART7_RX_PORT
#define ADIOS_UART7_RX_PORT     GPIOB
#endif
#ifndef ADIOS_UART7_RX_PIN
#define ADIOS_UART7_RX_PIN      LL_GPIO_PIN_11
#endif
#ifndef ADIOS_UART7_RX_AF
#define ADIOS_UART7_RX_AF       LL_GPIO_AF_4
#endif
#ifndef ADIOS_UART7
#define ADIOS_UART7             LPUART2
#endif
#ifndef ADIOS_UART7_IRQ_CHANNEL
#define ADIOS_UART7_IRQ_CHANNEL ADIOS_UART1_IRQ_CHANNEL
#endif
#ifndef ADIOS_UART7_IRQHANDLER_FUNC
#define ADIOS_UART7_IRQHANDLER_FUNC ADIOS_UART1_IRQHANDLER_FUNC
#endif
#ifndef ADIOS_UART7_RESET_FUNC
#define ADIOS_UART7_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_LPUART2); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_LPUART2); }
#endif
#ifndef ADIOS_UART7_CLOCK_FUNC
#define ADIOS_UART7_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_LPUART2); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOB); }
#endif
#ifndef ADIOS_UART7_CLOCK_SOURCE
#define ADIOS_UART7_CLOCK_SOURCE LL_RCC_LPUART2_CLKSOURCE_PCLK1
#endif
#endif


/////////////////////////////////////////////////////////////////////////////
// Local variables
/////////////////////////////////////////////////////////////////////////////

static u8  uart_assigned_to_midi;
static u32 uart_baudrate[ADIOS_UART_MAX_PORTS];
static adios_pin_mode_t  uart_tx_pin_mode[ADIOS_UART_MAX_PORTS];

// named per-port RX/TX buffers - only allocated for ports actually enabled
// via ADIOS_USE_UARTx, unlike the small per-port state above (baudrate,
// pin mode) and below (tail/head/size counters), which stay as cheap
// ADIOS_UART_MAX_PORTS-sized arrays regardless of enablement (a few bytes
// per port, not worth the indirection). The pointer tables below resolve
// each slot at compile time - NULL for any port not compiled in - so the
// existing generic array-indexed function bodies only need a NULL check
// added, no other logic changes.
#if defined(ADIOS_USE_UART0)
static u8 uart0_rx_buffer[ADIOS_UART_RX_BUFFER_SIZE];
static u8 uart0_tx_buffer[ADIOS_UART_TX_BUFFER_SIZE];
#endif
#if defined(ADIOS_USE_UART1)
static u8 uart1_rx_buffer[ADIOS_UART_RX_BUFFER_SIZE];
static u8 uart1_tx_buffer[ADIOS_UART_TX_BUFFER_SIZE];
#endif
#if defined(ADIOS_USE_UART2)
static u8 uart2_rx_buffer[ADIOS_UART_RX_BUFFER_SIZE];
static u8 uart2_tx_buffer[ADIOS_UART_TX_BUFFER_SIZE];
#endif
#if defined(ADIOS_USE_UART3)
static u8 uart3_rx_buffer[ADIOS_UART_RX_BUFFER_SIZE];
static u8 uart3_tx_buffer[ADIOS_UART_TX_BUFFER_SIZE];
#endif
#if defined(ADIOS_USE_UART4)
static u8 uart4_rx_buffer[ADIOS_UART_RX_BUFFER_SIZE];
static u8 uart4_tx_buffer[ADIOS_UART_TX_BUFFER_SIZE];
#endif
#if defined(ADIOS_USE_UART5)
static u8 uart5_rx_buffer[ADIOS_UART_RX_BUFFER_SIZE];
static u8 uart5_tx_buffer[ADIOS_UART_TX_BUFFER_SIZE];
#endif
#if defined(ADIOS_USE_UART6)
static u8 uart6_rx_buffer[ADIOS_UART_RX_BUFFER_SIZE];
static u8 uart6_tx_buffer[ADIOS_UART_TX_BUFFER_SIZE];
#endif
#if defined(ADIOS_USE_UART7)
static u8 uart7_rx_buffer[ADIOS_UART_RX_BUFFER_SIZE];
static u8 uart7_tx_buffer[ADIOS_UART_TX_BUFFER_SIZE];
#endif

static u8 * const rx_buffer_ptr[ADIOS_UART_MAX_PORTS] = {
#if defined(ADIOS_USE_UART0)
  uart0_rx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART1)
  uart1_rx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART2)
  uart2_rx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART3)
  uart3_rx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART4)
  uart4_rx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART5)
  uart5_rx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART6)
  uart6_rx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART7)
  uart7_rx_buffer,
#else
  NULL,
#endif
};
static u8 * const tx_buffer_ptr[ADIOS_UART_MAX_PORTS] = {
#if defined(ADIOS_USE_UART0)
  uart0_tx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART1)
  uart1_tx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART2)
  uart2_tx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART3)
  uart3_tx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART4)
  uart4_tx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART5)
  uart5_tx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART6)
  uart6_tx_buffer,
#else
  NULL,
#endif
#if defined(ADIOS_USE_UART7)
  uart7_tx_buffer,
#else
  NULL,
#endif
};

static volatile u8 rx_buffer_tail[ADIOS_UART_MAX_PORTS];
static volatile u8 rx_buffer_head[ADIOS_UART_MAX_PORTS];
static volatile u8 rx_buffer_size[ADIOS_UART_MAX_PORTS];

static volatile u8 tx_buffer_tail[ADIOS_UART_MAX_PORTS];
static volatile u8 tx_buffer_head[ADIOS_UART_MAX_PORTS];
static volatile u8 tx_buffer_size[ADIOS_UART_MAX_PORTS];


/////////////////////////////////////////////////////////////////////////////
//! Initializes UART interfaces
//! \param[in] mode currently only mode 0 supported
//! \return < 0 if initialisation failed
//! \note Applications shouldn't call this function directly, instead please use \ref ADIOS_COM or \ref ADIOS_MIDI layer functions
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_UART_Init(u32 mode)
{
  // currently only mode 0 supported
  if( mode != 0 )
    return -1; // unsupported mode

