AddictiveInstruments/ADIOS/adios/STM32G0xx/adios_uart.c
  // map UART pins and enable clocks
#if defined(ADIOS_USE_UART0) && ADIOS_UART0_ASSIGNMENT != 0
  ADIOS_UART0_RESET_FUNC;
  ADIOS_UART0_CLOCK_FUNC;
#endif
#if defined(ADIOS_USE_UART1) && ADIOS_UART1_ASSIGNMENT != 0
  ADIOS_UART1_RESET_FUNC;
  ADIOS_UART1_CLOCK_FUNC
#endif
#if defined(ADIOS_USE_UART2) && ADIOS_UART2_ASSIGNMENT != 0
  ADIOS_UART2_RESET_FUNC;
  ADIOS_UART2_CLOCK_FUNC
#endif
#if defined(ADIOS_USE_UART3) && ADIOS_UART3_ASSIGNMENT != 0
  ADIOS_UART3_RESET_FUNC;
  ADIOS_UART3_CLOCK_FUNC
#endif
#if defined(ADIOS_USE_UART4) && ADIOS_UART4_ASSIGNMENT != 0
  ADIOS_UART4_RESET_FUNC;
  ADIOS_UART4_CLOCK_FUNC
#endif
#if defined(ADIOS_USE_UART5) && ADIOS_UART5_ASSIGNMENT != 0
  ADIOS_UART5_RESET_FUNC;
  ADIOS_UART5_CLOCK_FUNC
#endif
#if defined(ADIOS_USE_UART6) && ADIOS_UART6_ASSIGNMENT != 0
  ADIOS_UART6_RESET_FUNC;
  ADIOS_UART6_CLOCK_FUNC
#endif
#if defined(ADIOS_USE_UART7) && ADIOS_UART7_ASSIGNMENT != 0
  ADIOS_UART7_RESET_FUNC;
  ADIOS_UART7_CLOCK_FUNC
#endif

  // initialize UARTs and clear buffers
  {
    u8 uart;
    for(uart=0; uart<ADIOS_UART_MAX_PORTS; ++uart) {
      rx_buffer_tail[uart] = rx_buffer_head[uart] = rx_buffer_size[uart] = 0;
      tx_buffer_tail[uart] = tx_buffer_head[uart] = tx_buffer_size[uart] = 0;

      ADIOS_UART_InitPortDefault(uart);
    }
  }

  // configure and enable UART interrupts
#if defined(ADIOS_USE_UART0) && ADIOS_UART0_ASSIGNMENT != 0
  ADIOS_IRQ_Install(ADIOS_UART0_IRQ_CHANNEL, ADIOS_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(ADIOS_UART0);
#endif
#if defined(ADIOS_USE_UART1) && ADIOS_UART1_ASSIGNMENT != 0
  ADIOS_IRQ_Install(ADIOS_UART1_IRQ_CHANNEL, ADIOS_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(ADIOS_UART1);
#endif
#if defined(ADIOS_USE_UART2) && ADIOS_UART2_ASSIGNMENT != 0
  ADIOS_IRQ_Install(ADIOS_UART2_IRQ_CHANNEL, ADIOS_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(ADIOS_UART2);
#endif
#if defined(ADIOS_USE_UART3) && ADIOS_UART3_ASSIGNMENT != 0
  ADIOS_IRQ_Install(ADIOS_UART3_IRQ_CHANNEL, ADIOS_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(ADIOS_UART3);
#endif
#if defined(ADIOS_USE_UART4) && ADIOS_UART4_ASSIGNMENT != 0
  ADIOS_IRQ_Install(ADIOS_UART4_IRQ_CHANNEL, ADIOS_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(ADIOS_UART4);
#endif
#if defined(ADIOS_USE_UART5) && ADIOS_UART5_ASSIGNMENT != 0
  ADIOS_IRQ_Install(ADIOS_UART5_IRQ_CHANNEL, ADIOS_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(ADIOS_UART5);
#endif
#if defined(ADIOS_USE_UART6) && ADIOS_UART6_ASSIGNMENT != 0
  ADIOS_IRQ_Install(ADIOS_UART6_IRQ_CHANNEL, ADIOS_IRQ_UART_PRIORITY);
  LL_LPUART_EnableIT_RXNE(ADIOS_UART6);
#endif
#if defined(ADIOS_USE_UART7) && ADIOS_UART7_ASSIGNMENT != 0
  ADIOS_IRQ_Install(ADIOS_UART7_IRQ_CHANNEL, ADIOS_IRQ_UART_PRIORITY);
  LL_LPUART_EnableIT_RXNE(ADIOS_UART7);
#endif

  // enable UARTs
#if defined(ADIOS_USE_UART0) && ADIOS_UART0_ASSIGNMENT != 0
  LL_USART_Enable(ADIOS_UART0);
  while((!(LL_USART_IsActiveFlag_TEACK(ADIOS_UART0))) || (!(LL_USART_IsActiveFlag_REACK(ADIOS_UART0)))){}
#endif
#if defined(ADIOS_USE_UART1) && ADIOS_UART1_ASSIGNMENT != 0
  LL_USART_Enable(ADIOS_UART1);
  while((!(LL_USART_IsActiveFlag_TEACK(ADIOS_UART1))) || (!(LL_USART_IsActiveFlag_REACK(ADIOS_UART1)))){}
#endif
#if defined(ADIOS_USE_UART2) && ADIOS_UART2_ASSIGNMENT != 0
  LL_USART_Enable(ADIOS_UART2);
  while((!(LL_USART_IsActiveFlag_TEACK(ADIOS_UART2))) || (!(LL_USART_IsActiveFlag_REACK(ADIOS_UART2)))){}
#endif
#if defined(ADIOS_USE_UART3) && ADIOS_UART3_ASSIGNMENT != 0
  LL_USART_Enable(ADIOS_UART3);
  while((!(LL_USART_IsActiveFlag_TEACK(ADIOS_UART3))) || (!(LL_USART_IsActiveFlag_REACK(ADIOS_UART3)))){}
#endif
#if defined(ADIOS_USE_UART4) && ADIOS_UART4_ASSIGNMENT != 0
  LL_USART_Enable(ADIOS_UART4);
  while((!(LL_USART_IsActiveFlag_TEACK(ADIOS_UART4))) || (!(LL_USART_IsActiveFlag_REACK(ADIOS_UART4)))){}
#endif
#if defined(ADIOS_USE_UART5) && ADIOS_UART5_ASSIGNMENT != 0
  LL_USART_Enable(ADIOS_UART5);
  while((!(LL_USART_IsActiveFlag_TEACK(ADIOS_UART5))) || (!(LL_USART_IsActiveFlag_REACK(ADIOS_UART5)))){}
#endif
#if defined(ADIOS_USE_UART6) && ADIOS_UART6_ASSIGNMENT != 0
  LL_LPUART_Enable(ADIOS_UART6);
  while((!(LL_LPUART_IsActiveFlag_TEACK(ADIOS_UART6))) || (!(LL_LPUART_IsActiveFlag_REACK(ADIOS_UART6)))){}
#endif
#if defined(ADIOS_USE_UART7) && ADIOS_UART7_ASSIGNMENT != 0
  LL_LPUART_Enable(ADIOS_UART7);
  while((!(LL_LPUART_IsActiveFlag_TEACK(ADIOS_UART7))) || (!(LL_LPUART_IsActiveFlag_REACK(ADIOS_UART7)))){}
#endif

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! \return 0 if UART is not assigned to a MIDI function
//! \return 1 if UART is assigned to a MIDI function
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_UART_IsAssignedToMIDI(u8 uart)
{
  if( uart >= ADIOS_UART_MAX_PORTS )
    return 0; // no UART available
  return (uart_assigned_to_midi & (1 << uart)) ? 1 : 0;
}


/////////////////////////////////////////////////////////////////////////////
//! Initializes a given UART interface based on given baudrate and TX output mode
//! \param[in] uart UART number (0..3)
//! \param[in] baudrate the baudrate
//! \param[in] tx_pin_mode the TX pin mode
//!   <UL>
//!     <LI>ADIOS_PIN_MODE_OUTPUT_PP: TX pin configured for push-pull mode
//!     <LI>ADIOS_PIN_MODE_OUTPUT_OD: TX pin configured for open drain mode
//!   </UL>
//! \param[in] is_midi MIDI or common UART interface?
//! \return < 0 if initialisation failed
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_UART_InitPort(u8 uart, u32 baudrate, adios_pin_mode_t tx_pin_mode, u8 is_midi)
{
  LL_GPIO_InitTypeDef GPIO_InitStructure;
  LL_GPIO_StructInit(&GPIO_InitStructure);

  if( uart >= ADIOS_UART_MAX_PORTS )
    return -1; // unsupported UART

  // MIDI assignment
  if( is_midi ) {
    uart_assigned_to_midi |= (1 << uart);
  } else {
    uart_assigned_to_midi &= ~(1 << uart);
  }
  // store pin mode
  uart_tx_pin_mode[uart]=tx_pin_mode;

  GPIO_InitStructure.Speed = LL_GPIO_SPEED_FREQ_HIGH;

  switch( uart ) {
#if defined(ADIOS_USE_UART0) && ADIOS_UART0_ASSIGNMENT != 0
  case 0: {
    GPIO_InitStructure.Pin = ADIOS_UART0_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == ADIOS_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = ADIOS_UART0_TX_AF;
    LL_GPIO_Init(ADIOS_UART0_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = ADIOS_UART0_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = ADIOS_UART0_RX_AF;
    LL_GPIO_Init(ADIOS_UART0_RX_PORT, &GPIO_InitStructure);

