AddictiveInstruments/ADIOS/adios/STM32G0xx/adios_uart.c
    ADIOS_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(ADIOS_USE_UART1) && ADIOS_UART1_ASSIGNMENT != 0
  case 1: {
    GPIO_InitStructure.Pin = ADIOS_UART1_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == ADIOS_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = ADIOS_UART1_TX_AF;
    LL_GPIO_Init(ADIOS_UART1_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = ADIOS_UART1_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = ADIOS_UART1_RX_AF;
    LL_GPIO_Init(ADIOS_UART1_RX_PORT, &GPIO_InitStructure);

    ADIOS_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(ADIOS_USE_UART2) && ADIOS_UART2_ASSIGNMENT != 0
  case 2: {
    GPIO_InitStructure.Pin = ADIOS_UART2_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == ADIOS_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = ADIOS_UART2_TX_AF;
    LL_GPIO_Init(ADIOS_UART2_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = ADIOS_UART2_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = ADIOS_UART2_RX_AF;
    LL_GPIO_Init(ADIOS_UART2_RX_PORT, &GPIO_InitStructure);

    ADIOS_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(ADIOS_USE_UART3) && ADIOS_UART3_ASSIGNMENT != 0
  case 3: {
    GPIO_InitStructure.Pin = ADIOS_UART3_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == ADIOS_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = ADIOS_UART3_TX_AF;
    LL_GPIO_Init(ADIOS_UART3_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = ADIOS_UART3_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = ADIOS_UART3_RX_AF;
    LL_GPIO_Init(ADIOS_UART3_RX_PORT, &GPIO_InitStructure);

    ADIOS_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(ADIOS_USE_UART4) && ADIOS_UART4_ASSIGNMENT != 0
  case 4: {
    GPIO_InitStructure.Pin = ADIOS_UART4_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == ADIOS_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = ADIOS_UART4_TX_AF;
    LL_GPIO_Init(ADIOS_UART4_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = ADIOS_UART4_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = ADIOS_UART4_RX_AF;
    LL_GPIO_Init(ADIOS_UART4_RX_PORT, &GPIO_InitStructure);

    ADIOS_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(ADIOS_USE_UART5) && ADIOS_UART5_ASSIGNMENT != 0
  case 5: {
    GPIO_InitStructure.Pin = ADIOS_UART5_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == ADIOS_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = ADIOS_UART5_TX_AF;
    LL_GPIO_Init(ADIOS_UART5_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = ADIOS_UART5_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = ADIOS_UART5_RX_AF;
    LL_GPIO_Init(ADIOS_UART5_RX_PORT, &GPIO_InitStructure);

    ADIOS_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(ADIOS_USE_UART6) && ADIOS_UART6_ASSIGNMENT != 0
  case 6: {
    GPIO_InitStructure.Pin = ADIOS_UART6_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == ADIOS_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = ADIOS_UART6_TX_AF;
    LL_GPIO_Init(ADIOS_UART6_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = ADIOS_UART6_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = ADIOS_UART6_RX_AF;
    LL_GPIO_Init(ADIOS_UART6_RX_PORT, &GPIO_InitStructure);

    ADIOS_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(ADIOS_USE_UART7) && ADIOS_UART7_ASSIGNMENT != 0
  case 7: {
    GPIO_InitStructure.Pin = ADIOS_UART7_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == ADIOS_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = ADIOS_UART7_TX_AF;
    LL_GPIO_Init(ADIOS_UART7_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = ADIOS_UART7_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = ADIOS_UART7_RX_AF;
    LL_GPIO_Init(ADIOS_UART7_RX_PORT, &GPIO_InitStructure);

