AddictiveInstruments/ADIOS/adios/STM32G0xx/adios_uart.c
    ADIOS_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

  default:
    return -1; // unsupported UART
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Initializes a given UART interface based on default settings
//! \param[in] uart UART number (0..3)
//! \return < 0 if initialisation failed
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_UART_InitPortDefault(u8 uart)
{
  switch( uart ) {
#if defined(ADIOS_USE_UART0) && ADIOS_UART0_ASSIGNMENT != 0
  case 0: {
# if ADIOS_UART0_TX_OD
    ADIOS_UART_InitPort(0, ADIOS_UART0_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_OD, ADIOS_UART0_ASSIGNMENT == 1);
# else
    ADIOS_UART_InitPort(0, ADIOS_UART0_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_PP, ADIOS_UART0_ASSIGNMENT == 1);
# endif
  } break;
#endif

#if defined(ADIOS_USE_UART1) && ADIOS_UART1_ASSIGNMENT != 0
  case 1: {
# if ADIOS_UART1_TX_OD
    ADIOS_UART_InitPort(1, ADIOS_UART1_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_OD, ADIOS_UART1_ASSIGNMENT == 1);
# else
    ADIOS_UART_InitPort(1, ADIOS_UART1_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_PP, ADIOS_UART1_ASSIGNMENT == 1);
# endif
  } break;
#endif

#if defined(ADIOS_USE_UART2) && ADIOS_UART2_ASSIGNMENT != 0
  case 2: {
# if ADIOS_UART2_TX_OD
    ADIOS_UART_InitPort(2, ADIOS_UART2_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_OD, ADIOS_UART2_ASSIGNMENT == 1);
# else
    ADIOS_UART_InitPort(2, ADIOS_UART2_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_PP, ADIOS_UART2_ASSIGNMENT == 1);
# endif
  } break;
#endif

#if defined(ADIOS_USE_UART3) && ADIOS_UART3_ASSIGNMENT != 0
  case 3: {
# if ADIOS_UART3_TX_OD
    ADIOS_UART_InitPort(3, ADIOS_UART3_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_OD, ADIOS_UART3_ASSIGNMENT == 1);
# else
    ADIOS_UART_InitPort(3, ADIOS_UART3_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_PP, ADIOS_UART3_ASSIGNMENT == 1);
# endif
  } break;
#endif

#if defined(ADIOS_USE_UART4) && ADIOS_UART4_ASSIGNMENT != 0
  case 4: {
# if ADIOS_UART4_TX_OD
    ADIOS_UART_InitPort(4, ADIOS_UART4_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_OD, ADIOS_UART4_ASSIGNMENT == 1);
# else
    ADIOS_UART_InitPort(4, ADIOS_UART4_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_PP, ADIOS_UART4_ASSIGNMENT == 1);
# endif
  } break;
#endif

#if defined(ADIOS_USE_UART5) && ADIOS_UART5_ASSIGNMENT != 0
  case 5: {
# if ADIOS_UART5_TX_OD
    ADIOS_UART_InitPort(5, ADIOS_UART5_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_OD, ADIOS_UART5_ASSIGNMENT == 1);
# else
    ADIOS_UART_InitPort(5, ADIOS_UART5_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_PP, ADIOS_UART5_ASSIGNMENT == 1);
# endif
  } break;
#endif

#if defined(ADIOS_USE_UART6) && ADIOS_UART6_ASSIGNMENT != 0
  case 6: {
# if ADIOS_UART6_TX_OD
    ADIOS_UART_InitPort(6, ADIOS_UART6_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_OD, ADIOS_UART6_ASSIGNMENT == 1);
# else
    ADIOS_UART_InitPort(6, ADIOS_UART6_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_PP, ADIOS_UART6_ASSIGNMENT == 1);
# endif
  } break;
#endif

#if defined(ADIOS_USE_UART7) && ADIOS_UART7_ASSIGNMENT != 0
  case 7: {
# if ADIOS_UART7_TX_OD
    ADIOS_UART_InitPort(7, ADIOS_UART7_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_OD, ADIOS_UART7_ASSIGNMENT == 1);
# else
    ADIOS_UART_InitPort(7, ADIOS_UART7_BAUDRATE, ADIOS_PIN_MODE_OUTPUT_PP, ADIOS_UART7_ASSIGNMENT == 1);
# endif
  } break;
#endif

  default:
    return -1; // unsupported UART
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! sets the baudrate of a UART port
//! \param[in] uart UART number (0..3)
//! \param[in] baudrate the baudrate
//! \return 0: baudrate has been changed
//! \return -1: uart not available
//! \return -2: function not prepared for this UART
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_UART_BaudrateSet(u8 uart, u32 baudrate)
{
  if( uart >= ADIOS_UART_MAX_PORTS )
    return -1;

  // USART configuration
  LL_USART_InitTypeDef USART_InitStructure;
  USART_InitStructure.DataWidth = LL_USART_DATAWIDTH_8B;
  USART_InitStructure.StopBits = LL_USART_STOPBITS_1;
  USART_InitStructure.Parity = LL_USART_PARITY_NONE;
  USART_InitStructure.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  USART_InitStructure.TransferDirection = LL_USART_DIRECTION_TX_RX;
  USART_InitStructure.OverSampling = LL_USART_OVERSAMPLING_16;
  USART_InitStructure.BaudRate = baudrate;
  USART_InitStructure.PrescalerValue = LL_USART_PRESCALER_DIV1;

  switch( uart ) {
#if defined(ADIOS_USE_UART0)
  case 0:
	  LL_USART_Init(ADIOS_UART0, &USART_InitStructure);
	  LL_USART_SetTXFIFOThreshold(ADIOS_UART0, LL_USART_FIFOTHRESHOLD_1_4);
	  LL_USART_SetRXFIFOThreshold(ADIOS_UART0, LL_USART_FIFOTHRESHOLD_1_8);
	  LL_USART_DisableFIFO(ADIOS_UART0);
	  LL_USART_DisableOverrunDetect(ADIOS_UART0);
	  LL_USART_DisableDMADeactOnRxErr(ADIOS_UART0);
	  LL_USART_ConfigAsyncMode(ADIOS_UART0);
#ifdef ADIOS_UART0_TX_INVERTED
	  LL_USART_SetTXPinLevel(ADIOS_UART0, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef ADIOS_UART0_CLOCK_SOURCE
	  LL_RCC_SetUSARTClockSource(ADIOS_UART0_CLOCK_SOURCE);
#endif
	  break;
#endif
#if defined(ADIOS_USE_UART1)
  case 1:
	  LL_USART_Init(ADIOS_UART1, &USART_InitStructure);
	  LL_USART_SetTXFIFOThreshold(ADIOS_UART1, LL_USART_FIFOTHRESHOLD_1_4);
	  LL_USART_SetRXFIFOThreshold(ADIOS_UART1, LL_USART_FIFOTHRESHOLD_1_8);
	  LL_USART_DisableFIFO(ADIOS_UART1);
	  LL_USART_DisableOverrunDetect(ADIOS_UART1);
	  LL_USART_DisableDMADeactOnRxErr(ADIOS_UART1);
	  LL_USART_ConfigAsyncMode(ADIOS_UART1);
#ifdef ADIOS_UART1_TX_INVERTED
	  LL_USART_SetTXPinLevel(ADIOS_UART1, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef ADIOS_UART1_CLOCK_SOURCE
	  LL_RCC_SetUSARTClockSource(ADIOS_UART1_CLOCK_SOURCE);
#endif
	  break;
#endif
#if defined(ADIOS_USE_UART2)
  case 2:
	  LL_USART_Init(ADIOS_UART2, &USART_InitStructure);
	  LL_USART_DisableOverrunDetect(ADIOS_UART2);
	  LL_USART_DisableDMADeactOnRxErr(ADIOS_UART2);
	  LL_USART_ConfigAsyncMode(ADIOS_UART2);
#ifdef ADIOS_UART2_TX_INVERTED
	  LL_USART_SetTXPinLevel(ADIOS_UART2, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef ADIOS_UART2_CLOCK_SOURCE
	  LL_RCC_SetUSARTClockSource(ADIOS_UART2_CLOCK_SOURCE);
#endif
	  break;
#endif
#if defined(ADIOS_USE_UART3)
  case 3:
	  LL_USART_Init(ADIOS_UART3, &USART_InitStructure);
	  LL_USART_DisableOverrunDetect(ADIOS_UART3);
	  LL_USART_DisableDMADeactOnRxErr(ADIOS_UART3);
	  LL_USART_ConfigAsyncMode(ADIOS_UART3);
#ifdef ADIOS_UART3_TX_INVERTED
	  LL_USART_SetTXPinLevel(ADIOS_UART3, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef ADIOS_UART3_CLOCK_SOURCE
	  LL_RCC_SetUSARTClockSource(ADIOS_UART3_CLOCK_SOURCE);
#endif
	  break;
#endif
#if defined(ADIOS_USE_UART4)
  case 4:
	  LL_USART_Init(ADIOS_UART4, &USART_InitStructure);
	  LL_USART_DisableOverrunDetect(ADIOS_UART4);
	  LL_USART_DisableDMADeactOnRxErr(ADIOS_UART4);
	  LL_USART_ConfigAsyncMode(ADIOS_UART4);
#ifdef ADIOS_UART4_TX_INVERTED
	  LL_USART_SetTXPinLevel(ADIOS_UART4, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef ADIOS_UART4_CLOCK_SOURCE
	  LL_RCC_SetUSARTClockSource(ADIOS_UART4_CLOCK_SOURCE);
#endif
	  break;
#endif
#if defined(ADIOS_USE_UART5)
  case 5:
	  LL_USART_Init(ADIOS_UART5, &USART_InitStructure);
	  LL_USART_DisableOverrunDetect(ADIOS_UART5);
	  LL_USART_DisableDMADeactOnRxErr(ADIOS_UART5);
	  LL_USART_ConfigAsyncMode(ADIOS_UART5);
#ifdef ADIOS_UART5_TX_INVERTED
	  LL_USART_SetTXPinLevel(ADIOS_UART5, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef ADIOS_UART5_CLOCK_SOURCE
	  LL_RCC_SetUSARTClockSource(ADIOS_UART5_CLOCK_SOURCE);
#endif
	  break;
#endif
#if defined(ADIOS_USE_UART6)
  case 6: {
    // LPUART: separate LL API/init struct - fixed x256 oversampling (no
    // OverSampling field), PRESC-based BRR instead of LL_USART's - see
    // module-level comment above.
    LL_LPUART_InitTypeDef LPUART_InitStructure;
    LPUART_InitStructure.DataWidth = LL_LPUART_DATAWIDTH_8B;
    LPUART_InitStructure.StopBits = LL_LPUART_STOPBITS_1;
    LPUART_InitStructure.Parity = LL_LPUART_PARITY_NONE;
    LPUART_InitStructure.HardwareFlowControl = LL_LPUART_HWCONTROL_NONE;
    LPUART_InitStructure.TransferDirection = LL_LPUART_DIRECTION_TX_RX;
    LPUART_InitStructure.BaudRate = baudrate;
    LPUART_InitStructure.PrescalerValue = LL_LPUART_PRESCALER_DIV1;
    LL_LPUART_Init(ADIOS_UART6, &LPUART_InitStructure);
    LL_LPUART_SetTXFIFOThreshold(ADIOS_UART6, LL_LPUART_FIFOTHRESHOLD_1_4);
    LL_LPUART_SetRXFIFOThreshold(ADIOS_UART6, LL_LPUART_FIFOTHRESHOLD_1_8);
    LL_LPUART_DisableFIFO(ADIOS_UART6);
    LL_LPUART_DisableOverrunDetect(ADIOS_UART6);
    LL_LPUART_DisableDMADeactOnRxErr(ADIOS_UART6);
#ifdef ADIOS_UART6_TX_INVERTED
    LL_LPUART_SetTXPinLevel(ADIOS_UART6, LL_LPUART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef ADIOS_UART6_CLOCK_SOURCE
    LL_RCC_SetLPUARTClockSource(ADIOS_UART6_CLOCK_SOURCE);
#endif
  } break;
#endif
#if defined(ADIOS_USE_UART7)
  case 7: {
    LL_LPUART_InitTypeDef LPUART_InitStructure;
    LPUART_InitStructure.DataWidth = LL_LPUART_DATAWIDTH_8B;
    LPUART_InitStructure.StopBits = LL_LPUART_STOPBITS_1;
    LPUART_InitStructure.Parity = LL_LPUART_PARITY_NONE;
    LPUART_InitStructure.HardwareFlowControl = LL_LPUART_HWCONTROL_NONE;
    LPUART_InitStructure.TransferDirection = LL_LPUART_DIRECTION_TX_RX;
    LPUART_InitStructure.BaudRate = baudrate;
    LPUART_InitStructure.PrescalerValue = LL_LPUART_PRESCALER_DIV1;
    LL_LPUART_Init(ADIOS_UART7, &LPUART_InitStructure);
    LL_LPUART_SetTXFIFOThreshold(ADIOS_UART7, LL_LPUART_FIFOTHRESHOLD_1_4);
    LL_LPUART_SetRXFIFOThreshold(ADIOS_UART7, LL_LPUART_FIFOTHRESHOLD_1_8);
    LL_LPUART_DisableFIFO(ADIOS_UART7);
    LL_LPUART_DisableOverrunDetect(ADIOS_UART7);
    LL_LPUART_DisableDMADeactOnRxErr(ADIOS_UART7);
#ifdef ADIOS_UART7_TX_INVERTED
    LL_LPUART_SetTXPinLevel(ADIOS_UART7, LL_LPUART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef ADIOS_UART7_CLOCK_SOURCE
    LL_RCC_SetLPUARTClockSource(ADIOS_UART7_CLOCK_SOURCE);
#endif
  } break;
#endif
  default:
    return -2; // not prepared
  }

  // store baudrate in array
  uart_baudrate[uart] = baudrate;

