AddictiveInstruments/ADIOS/adios/STM32G0xx/adios_uart.c
  // copy bytes to be transmitted into transmit buffer
  // this operation should be atomic!
  ADIOS_IRQ_Disable();

  u16 i;
  for(i=0; i<len; ++i) {
    tx_buffer_ptr[uart][tx_buffer_head[uart]] = *buffer++;

    if( ++tx_buffer_head[uart] >= ADIOS_UART_TX_BUFFER_SIZE )
      tx_buffer_head[uart] = 0;

    // enable Tx interrupt if buffer was empty
    if( ++tx_buffer_size[uart] == 1 ) {
      switch( uart ) {
#if defined(ADIOS_USE_UART0)
        case 0: ADIOS_UART0->CR1 |= (1 << 7); break; // enable TXE interrupt (TXEIE=1)
#endif
#if defined(ADIOS_USE_UART1)
        case 1: ADIOS_UART1->CR1 |= (1 << 7); break; // enable TXE interrupt (TXEIE=1)
#endif
#if defined(ADIOS_USE_UART2)
        case 2: ADIOS_UART2->CR1 |= (1 << 7); break; // enable TXE interrupt (TXEIE=1)
#endif
#if defined(ADIOS_USE_UART3)
        case 3: ADIOS_UART3->CR1 |= (1 << 7); break; // enable TXE interrupt (TXEIE=1)
#endif
#if defined(ADIOS_USE_UART4)
        case 4: ADIOS_UART4->CR1 |= (1 << 7); break; // enable TXE interrupt (TXEIE=1)
#endif
#if defined(ADIOS_USE_UART5)
        case 5: ADIOS_UART5->CR1 |= (1 << 7); break; // enable TXE interrupt (TXEIE=1)
#endif
#if defined(ADIOS_USE_UART6)
        case 6: ADIOS_UART6->CR1 |= (1 << 7); break; // enable TXE interrupt (TXEIE=1) - LPUART shares the same CR1 layout
#endif
#if defined(ADIOS_USE_UART7)
        case 7: ADIOS_UART7->CR1 |= (1 << 7); break; // enable TXE interrupt (TXEIE=1) - LPUART shares the same CR1 layout
#endif
        default: ADIOS_IRQ_Enable(); return -3; // uart not supported by routine (yet)
      }
    }
  }

  ADIOS_IRQ_Enable();

  return 0; // no error
}

/////////////////////////////////////////////////////////////////////////////
//! puts more than one byte onto the transmit buffer (used for atomic sends)<BR>
//! (blocking function)
//! \param[in] uart UART number (0..3)
//! \param[in] *buffer pointer to buffer to be sent
//! \param[in] len number of bytes to be sent
//! \return 0 if no error
//! \return -1 if UART not available
//! \return -3 if UART not supported by ADIOS_UART_TxBufferPut Routine
//! \note Applications shouldn't call these functions directly, instead please use \ref ADIOS_COM or \ref ADIOS_MIDI layer functions
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_UART_TxBufferPutMore(u8 uart, u8 *buffer, u16 len)
{
  s32 error;

  while( (error=ADIOS_UART_TxBufferPutMore_NonBlocking(uart, buffer, len)) == -2 );

  return error;
}


/////////////////////////////////////////////////////////////////////////////
//! puts a byte onto the transmit buffer
//! \param[in] uart UART number (0..3)
//! \param[in] b byte which should be put into Tx buffer
//! \return 0 if no error
//! \return -1 if UART not available
//! \return -2 if buffer full (retry)
//! \return -3 if UART not supported by ADIOS_UART_TxBufferPut Routine
//! \note Applications shouldn't call these functions directly, instead please use \ref ADIOS_COM or \ref ADIOS_MIDI layer functions
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_UART_TxBufferPut_NonBlocking(u8 uart, u8 b)
{
  // for more comfortable usage...
  // -> just forward to ADIOS_UART_TxBufferPutMore
  return ADIOS_UART_TxBufferPutMore(uart, &b, 1);
}


/////////////////////////////////////////////////////////////////////////////
//! puts a byte onto the transmit buffer<BR>
//! (blocking function)
//! \param[in] uart UART number (0..3)
//! \param[in] b byte which should be put into Tx buffer
//! \return 0 if no error
//! \return -1 if UART not available
//! \return -3 if UART not supported by ADIOS_UART_TxBufferPut Routine
//! \note Applications shouldn't call these functions directly, instead please use \ref ADIOS_COM or \ref ADIOS_MIDI layer functions
/////////////////////////////////////////////////////////////////////////////
s32 ADIOS_UART_TxBufferPut(u8 uart, u8 b)
{
  s32 error;

  while( (error=ADIOS_UART_TxBufferPutMore(uart, &b, 1)) == -2 );

  return error;
}


/////////////////////////////////////////////////////////////////////////////
// Interrupt handler for UART0 (USART1) - independent NVIC vector
/////////////////////////////////////////////////////////////////////////////
#if defined(ADIOS_USE_UART1)
ADIOS_UART1_IRQHANDLER_FUNC
{
  if( ADIOS_UART1->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = ADIOS_UART1->RDR;
    s32 status = ADIOS_UART_IsAssignedToMIDI(1) ? ADIOS_MIDI_SendByteToRxCallback(DIN1, b) : 0;

    if( status == 0 && ADIOS_UART_RxBufferPut(1, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( ADIOS_UART1->ISR & (1 << 7) ) { // check if TXE flag is set
    if( ADIOS_UART_TxBufferUsed(1) > 0 ) {
      s32 b = ADIOS_UART_TxBufferGet(1);
      if( b < 0 ) {
	ADIOS_UART1->TDR = 0xff;
      } else {
	ADIOS_UART1->TDR = b;
      }
    } else {
      ADIOS_UART1->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
}
#endif


/////////////////////////////////////////////////////////////////////////////
// Interrupt handler for UART1 (USART2) - independent NVIC vector on every
// tier except 6-USART+2xLPUART (G0B1/G0C1), where it's combined with UART7
// (LPUART2) instead (USART2_LPUART2_IRQn - see ADIOS_UART2_IRQHANDLER_FUNC,
// already tier-resolved to the right function name/signature above). Written
// as a single function body (like the UART2 group below) so the same source
// is correct on every tier: the UART7 block below simply never compiles in
// on tiers where UART7 doesn't exist.
/////////////////////////////////////////////////////////////////////////////
#if defined(ADIOS_USE_UART2) || defined(ADIOS_USE_UART7)
ADIOS_UART2_IRQHANDLER_FUNC
{
#if defined(ADIOS_USE_UART2)
  if( ADIOS_UART2->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = ADIOS_UART2->RDR;
    s32 status = ADIOS_UART_IsAssignedToMIDI(2) ? ADIOS_MIDI_SendByteToRxCallback(DIN2, b) : 0;

    if( status == 0 && ADIOS_UART_RxBufferPut(2, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( ADIOS_UART2->ISR & (1 << 7) ) { // check if TXE flag is set
    if( ADIOS_UART_TxBufferUsed(2) > 0 ) {
      s32 b = ADIOS_UART_TxBufferGet(2);
      if( b < 0 ) {
	ADIOS_UART2->TDR = 0xff;
      } else {
	ADIOS_UART2->TDR = b;
      }
    } else {
      ADIOS_UART2->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif

#if defined(ADIOS_USE_UART7)
  if( ADIOS_UART7->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = ADIOS_UART7->RDR;
    s32 status = ADIOS_UART_IsAssignedToMIDI(7) ? ADIOS_MIDI_SendByteToRxCallback(DIN7, b) : 0;

    if( status == 0 && ADIOS_UART_RxBufferPut(7, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( ADIOS_UART7->ISR & (1 << 7) ) { // check if TXE flag is set
    if( ADIOS_UART_TxBufferUsed(7) > 0 ) {
      s32 b = ADIOS_UART_TxBufferGet(7);
      if( b < 0 ) {
	ADIOS_UART7->TDR = 0xff;
      } else {
	ADIOS_UART7->TDR = b;
      }
    } else {
      ADIOS_UART7->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif
}
#endif


/////////////////////////////////////////////////////////////////////////////
// Interrupt handler for UART2 (USART3), UART3 (USART4), on the 6-USART
// tier UART4 (USART5)/UART5 (USART6) too, and on the "+LPUART" siblings of
// the 4-USART and 6-USART tiers, UART6 (LPUART1) as well (see
// ADIOS_G0_LPUART1_SHARED above - NOT on the 2-USART+LPUART1 tier, where
// UART6 has its own independent vector instead, serviced by the standalone
// handler further below). These peripherals share a single NVIC vector
// (see ADIOS_UART_SHARED_IRQ_CHANNEL above), so this ONE handler function
// services whichever of them is enabled. Each branch is written
// unconditionally here since the vector/handler name is shared regardless
// of which subset is active (on the plain 4-USART tier, UART4/UART5 are
// always force-undef'd, so those blocks simply never compile in there).
#if defined(ADIOS_USE_UART0) || defined(ADIOS_USE_UART3) || defined(ADIOS_USE_UART4) || defined(ADIOS_USE_UART5) || (defined(ADIOS_USE_UART6) && defined(ADIOS_G0_LPUART1_SHARED))
ADIOS_UART0_IRQHANDLER_FUNC
{
#if defined(ADIOS_USE_UART0)
  if( ADIOS_UART0->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = ADIOS_UART0->RDR;
    s32 status = ADIOS_UART_IsAssignedToMIDI(0) ? ADIOS_MIDI_SendByteToRxCallback(DIN0, b) : 0;

    if( status == 0 && ADIOS_UART_RxBufferPut(0, b) < 0 ) {
      // here we could add some error handling
    }
  }

