AddictiveInstruments/ADIOS/adios/STM32G0xx/adios_uart.c
  if( ADIOS_UART0->ISR & (1 << 7) ) { // check if TXE flag is set
    if( ADIOS_UART_TxBufferUsed(0) > 0 ) {
      s32 b = ADIOS_UART_TxBufferGet(0);
      if( b < 0 ) {
	ADIOS_UART0->TDR = 0xff;
      } else {
	ADIOS_UART0->TDR = b;
      }
    } else {
      ADIOS_UART0->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif

#if defined(ADIOS_USE_UART3)
  if( ADIOS_UART3->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = ADIOS_UART3->RDR;
    s32 status = ADIOS_UART_IsAssignedToMIDI(3) ? ADIOS_MIDI_SendByteToRxCallback(DIN3, b) : 0;

    if( status == 0 && ADIOS_UART_RxBufferPut(3, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( ADIOS_UART3->ISR & (1 << 7) ) { // check if TXE flag is set
    if( ADIOS_UART_TxBufferUsed(3) > 0 ) {
      s32 b = ADIOS_UART_TxBufferGet(3);
      if( b < 0 ) {
	ADIOS_UART3->TDR = 0xff;
      } else {
	ADIOS_UART3->TDR = b;
      }
    } else {
      ADIOS_UART3->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif

#if defined(ADIOS_USE_UART4)
  if( ADIOS_UART4->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = ADIOS_UART4->RDR;
    s32 status = ADIOS_UART_IsAssignedToMIDI(4) ? ADIOS_MIDI_SendByteToRxCallback(DIN4, b) : 0;

    if( status == 0 && ADIOS_UART_RxBufferPut(4, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( ADIOS_UART4->ISR & (1 << 7) ) { // check if TXE flag is set
    if( ADIOS_UART_TxBufferUsed(4) > 0 ) {
      s32 b = ADIOS_UART_TxBufferGet(4);
      if( b < 0 ) {
	ADIOS_UART4->TDR = 0xff;
      } else {
	ADIOS_UART4->TDR = b;
      }
    } else {
      ADIOS_UART4->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif

#if defined(ADIOS_USE_UART5)
  if( ADIOS_UART5->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = ADIOS_UART5->RDR;
    s32 status = ADIOS_UART_IsAssignedToMIDI(5) ? ADIOS_MIDI_SendByteToRxCallback(DIN5, b) : 0;

    if( status == 0 && ADIOS_UART_RxBufferPut(5, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( ADIOS_UART5->ISR & (1 << 7) ) { // check if TXE flag is set
    if( ADIOS_UART_TxBufferUsed(5) > 0 ) {
      s32 b = ADIOS_UART_TxBufferGet(5);
      if( b < 0 ) {
	ADIOS_UART5->TDR = 0xff;
      } else {
	ADIOS_UART5->TDR = b;
      }
    } else {
      ADIOS_UART5->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif

#if defined(ADIOS_USE_UART6) && defined(ADIOS_G0_LPUART1_SHARED)
  if( ADIOS_UART6->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = ADIOS_UART6->RDR;
    s32 status = ADIOS_UART_IsAssignedToMIDI(6) ? ADIOS_MIDI_SendByteToRxCallback(DIN6, b) : 0;

    if( status == 0 && ADIOS_UART_RxBufferPut(6, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( ADIOS_UART6->ISR & (1 << 7) ) { // check if TXE flag is set
    if( ADIOS_UART_TxBufferUsed(6) > 0 ) {
      s32 b = ADIOS_UART_TxBufferGet(6);
      if( b < 0 ) {
	ADIOS_UART6->TDR = 0xff;
      } else {
	ADIOS_UART6->TDR = b;
      }
    } else {
      ADIOS_UART6->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif
}
#endif


/////////////////////////////////////////////////////////////////////////////
// Interrupt handler for UART6 (LPUART1) on the 2-USART+LPUART1 tier only,
// where it has its own independent vector (LPUART1_IRQn) rather than
// sharing the USART3+ group above (see ADIOS_G0_LPUART1_SHARED).
/////////////////////////////////////////////////////////////////////////////
#if defined(ADIOS_USE_UART6) && !defined(ADIOS_G0_LPUART1_SHARED)
ADIOS_UART6_IRQHANDLER_FUNC
{
  if( ADIOS_UART6->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = ADIOS_UART6->RDR;
    s32 status = ADIOS_UART_IsAssignedToMIDI(6) ? ADIOS_MIDI_SendByteToRxCallback(DIN6, b) : 0;

    if( status == 0 && ADIOS_UART_RxBufferPut(6, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( ADIOS_UART6->ISR & (1 << 7) ) { // check if TXE flag is set
    if( ADIOS_UART_TxBufferUsed(6) > 0 ) {
      s32 b = ADIOS_UART_TxBufferGet(6);
      if( b < 0 ) {
	ADIOS_UART6->TDR = 0xff;
      } else {
	ADIOS_UART6->TDR = b;
      }
    } else {
      ADIOS_UART6->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
}
#endif


//! \}

#endif /* ADIOS_USE_UART */
